Revit 2026 API

# AdaptiveComponentInstanceUtilsGetInstancePlacementPointElementRefIds Method

---

Gets Placement Adaptive Point Element Ref ids to which the instance geometry adapts.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<ElementId> GetInstancePlacementPointElementRefIds(
	FamilyInstance famInst
)
```
```vb
Public Shared Function GetInstancePlacementPointElementRefIds (
	famInst As FamilyInstance
) As IList(Of ElementId)
```
```cpp
public:
static IList<ElementId^>^ GetInstancePlacementPointElementRefIds(
	FamilyInstance^ famInst
)
```
```fsharp
static member GetInstancePlacementPointElementRefIds :
        famInst : FamilyInstance -> IList<ElementId>
```

#### Parameters

famInst FamilyInstance
     The FamilyInstance.

#### Return Value

IListElementId The Placement Adaptive Point Element Ref ids to which the instance geometry adapts.

| Exception | Condition |
| --- | --- |
| ArgumentException | The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This operation failed. |

The output contains placement point ref ids. The element ids are sorted in by the placement numbers (increasing order).

#### Reference

AdaptiveComponentInstanceUtils Class

Autodesk.Revit.DB Namespace